<?php
    //додати дані з цього файлу у головний index.html
    
    // Ну вот и все! Может урок и скучный, но очень полезный. Здесь показана только идея регистрации, далее Вы можете усовершенствовать ее:
    //  добавить защиту, оформление, поля с данными, загрузку аватаров, 
    // выход из аккаунта (для этого просто уничтожить переменные из сессии функцией unset) и так далее. Удачи!

    //  уся процедура працює на сесіях. саме в ній зберігаються дані користувача, поки він знаходиться на сайті. Дуже важливо заупустити їх на початку сторінки!!!
    session_start();
    ?>
    <html>
    <head>
    <title>Головна сторінка</title>
    </head>
    <body>
    <h2>Головна сторінка</h2>
    <form action="testreg.php" method="post">

    <!--****  testreg.php - це адреса для обробки. Після натискання "Увійти" дані з полів відправляються на testreg.php методом "post" ***** -->
    <p>
    <label>Ваш логин:<br></label>
    <input name="login" type="text" size="15" maxlength="15">
    </p>


    <!--**** В текстове поле (name="login" type="text") користувач вводить свій логін ***** -->
 
    <p>

    <label>Ваш пароль:<br></label>
    <input name="password" type="password" size="15" maxlength="15">
    </p>

    <!--**** В поле для паролів (name="password" type="password") користувач вводить свій пароль ***** --> 

    <p>
    <input type="submit" name="submit" value="Войти">

    <!--**** Кнопка (type="submit") відправляє дані на сторінку testreg.php ***** --> 
    <br>
    <!--**** посилання на реєстрацію ***** --> 
    <a href="reg.php">Зареєструватися</a> 
    </p></form>
    <br>
    <?php
    // Перевіряємо, чи пусті змінні логіна и id користувача
    if (empty($_SESSION['login']) or empty($_SESSION['id']))
    {
    // Якщо пусті, то ми не виводио посилання
    echo "Ви увійшли на сайт, як гість<br><a href='#'>Це посилання доступне лише зареєстрованим користувачам</a>";
    }
    else
    {

    // Якщо не пусті, то виводимо посилання
    echo "Ви увійшли на сайт, як ".$_SESSION['login']."<br><a  href='<!--****посилання на сайт *****-->'>Це посилання доступне лише зареєстрованим користувачам</a>";
    }
    ?>
    </body>
    </html>